{
  "basics": {
    "name": "Amr Sherif",
    "label": "AI Scientist, Data and Analytics",
    "image": "",
    "email": "amr.achraff@gmail.com",
    "phone": "+971586371123",
    "url": "https://amrsherif.live/",
    "summary": "I’m an AI scientist and data science professional specializing in artificial intelligence, machine learning, data engineering, and business analytics. My expertise includes LLMs, pretraining, fine-tuning, RLHF, Human-LLM interaction and RAG. In my current role, I lead both data science and business intelligence teams in Postpay a Fintech and BNPL company, focused on leveraging AI and machine learning to drive business insights and operational efficiency. I have led initiatives driving innovations in fraud detection, credit risk assessment, and automated reporting. Previously, I held several key positions at SWVL a global TaaS (Transportation as a service) company, including Automations & Operations Global Manager and Ops & Analytics Country Manager, where I implemented groundbreaking solutions for operational efficiency and fraud prevention.",
    "location": {
      "address": "Jumeirah Garden City",
      "postalCode": "",
      "city": "Dubai",
      "countryCode": "AE",
      "region": "Dubai"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "amrachraf",
        "url": "https://www.linkedin.com/in/amrachraf"
      }
    ]
  },
  "work": [
    {
      "name": "Postpay, Dubai, Uae",
      "position": "Data Science, BI & Analytics Manager",
      "url": "https://postpay.io",
      "startDate": "2023-03-01",
//      "endDate": "1955-01-01",
      "summary": "Leading Data Science, BI & Analytics in the organization.\n● Owning unit economics model and net transaction margin across the merchants portfolio.\n● Develop fraud detection and credit risk assessment models to minimize risk exposure and optimize customer underwriting process.\n● Develop & Maintain data warehouse infrastructure and real-time data pipelines for ML Models.\n● Develop a fully automated reporting process, including accurate and timely automated insights with minimal manual intervention.\n● 20+ weekly & monthly automated reports/insights for senior leadership.\n● Credit risk and fraud management, including the analysis of different fraud patterns, forecasting potential risks, managing and tracking\nnon-performing loans (NPLs), and enhancing risk policies.\n● End-to-End ownership and Liasoning with multiple teams (Data Engineers, Strategy, Operations, Product, CX)\n● Streamlining data management and enhancing efficiency & data accessibility for all business units.\n● Developed, and maintained robust ETL pipelines using AWS Glue to process and transform large datasets from various sources into\nstructured formats.\n● Implemented and managed ongoing data replication processes using AWS DMS, ensuring real-time data synchronization and high\navailability across multiple environments.\n● Managed and updated the data catalog to ensure proper metadata and schema definitions, enhancing data discoverability and usability.\n● Coordination between different Internal & external stakeholders.\n● Build Pnl & financial automated reporting/tracking tools.\n● Enhance the company's operational excellence through business intelligence, data-driven optimization.\n● Maximize operational efficiency while controlling cost by digitizing & automating workflows, streamline processes, and ensure full\nutilization of our third party tools & tech.\n● Identify operational areas with potential of enhancements to drive efficiency, productivity & cost control.\n● Digitize & automate manual/offline operations.\n● End-to-End Growth Marketing campaigns planning & budgeting, including campaign mechanics, forecast and projections",
      "highlights": ["Ideated, scoped, and launched a Graph Neural Network Fraud Detection Model, leveraging 114+ data points and engineered features from transaction and identity data. The comprehensive model development process included rigorous data preprocessing and cleansing, an exhaustive feature selection process, and multiple iterations across different model architectures and algorithms. The final model constructed a graph with over 500K nodes and 9M edges, achieving a false positive rate of less than 1% and successfully blocking 86% of fraudulent transactions (recall).", "Ideated, scoped, and launched transaction monitoring initiative, an automated anomaly detection and actionable alerts workflow including setting up processes, tools, and integrations to increase efficiency, financial control, reporting accuracy, and enhance cash-flow. Effectively detecting suspicious behaviors and patterns in transactions with 95% accuracy, while saving 80+ weekly working hours of manual back-office activities.", "Ideated, scoped, and launched fully automated recovery/collection process including customized robocalls, whatsapp & sms communications & notifications for different defaulting cohorts and customer segments, as well as introducing an automated promise to pay workflow and follow-ups. Increased Recovery rates to ∼90% of the amount in default on a cohort basis. Increased the recovery team operational capacity by ∼40% without increasing overheads/headcount. Saved 120+ weekly working hours of manual back-office activities.", "scoped, and launched convenience fee initiative aimed to improve the transaction margins in certain key accounts within a specific order value buckets, portfolio category, and different risk profiles segmentation. Contributed to reducing negative retailers across the portfolio to less than 5%.", "Ideated, scoped, and launched additional revenue streams initiative including PnL optimization through the introduction of multiple value added services on retailers as well as customers level. Contributed to ∼11% increase in Gross Profit.", "Developed Multiple automated scripts & utilities to support the daily operational back-office activities (reconciliations, settlements, invoicing, financial reporting, commercial pricing, growth marketing, operations, recoveries, customer experience ...etc). Saved 200+ weekly working hours of manual back-office activities."]
    },
    {
      "name": "Swvl, Dubai, Uae",
      "position": "Analytics & Operations Regional Manager",
      "url": "https://swvl.io",
      "startDate": "2022-05-01",
      "endDate": "2023-01-01",
      "summary": "Leading operations & payments teams of 9 individuals across 9+ markets, program managed the business as usual ops in my function.\n● Planning & executing global projects/strategies/roadmaps with the global leadership team.\n● Setting-up global strategies, workflows, processes, KPIs, SOPs, and SLAs, to meet org objectives per each market.\n● Structuring viable GTM strategies for different projects.\n● Build Pnl & financial automated reporting/tracking tools & platforms.\n● Coordination between different Internal & external stakeholders.\n● Reviewing different incentives, penalties, pricing schemes, and margins.\n● Automating suppliers/captains weekly payout process across markets.\n● Automating B2B clients monthly invoicing with a seamless & convenient digitized flow to ensure efficiency and enhance customer\nexperience.\n● Identify operational areas with potential of enhancements to drive efficiency, productivity & cost control.\n● Coordinating with Product teams in discovery, problem statement, specs, impact sizing and testing.\n● Digitize & automate manual/offline operations.\n● Build features/tools/scripts with customized logics to fulfill fast-paced business needs and drive operational excellence.",
      "highlights": ["Ideated, scoped, and launched B2C & B2B Cash Collection initiative including setting up processes, tools, and integrations to increase efficiency, financial control, reporting accuracy, and enhance cash-flow. Captured ∼50% of the total outstanding amount in the first month.", "Developed Multiple Bulk upload features with customized validation logics & different access rights per market to support high volume of recurrent operational activities. Saved 1200+ weekly working hours of manual back-office activities.", "Developed Financial Reporting platform for Pnl/receivables/payables with auto-triggered slack/email notif.", "Ideated, scoped, and launched a Clients auto-billing platform with a clients portal to track their invoices and features for raising a\ndispute/complaint integrated with a help desk solution. Contributed to a seamless invoicing/cash-collection experience for B2B customers\nand saved 800+ AMs weekly working hours.", "Ideated, scoped, and launched a Suppliers portal to track their financials, payments, and performance with localized & customized views,\nand features for raising a dispute/complaint integrated with a help desk solution. Contributed to a seamless supplier’s payment/cash-collection experience and contributed to increasing the financial tickets deflection rate by ∼70% by promoting a self-service strategy & implementing automated workflows. Saved ∼$30K of the support team costs.", "Developed Multiple automated scripts & utilities to support daily operational back-office activities (pricing, invoicing, planning, live ops...etc)"]
    },
    {
      "name": "Swvl, Cairo, Egy",
      "position": "Automations & Operations Country Manager",
      "url": "https://swvl.io",
      "startDate": "2021-12-01",
      "endDate": "2022-05-01",
//      "summary": "Leading operations & payments teams of 9 individuals across 9+ markets, program managed the business as usual ops in my function.\n● Planning & executing global projects/strategies/roadmaps with the global leadership team.\n● Setting-up global strategies, workflows, processes, KPIs, SOPs, and SLAs, to meet org objectives per each market.\n● Structuring viable GTM strategies for different projects.\n● Build Pnl & financial automated reporting/tracking tools & platforms.\n● Coordination between different Internal & external stakeholders.\n● Reviewing different incentives, penalties, pricing schemes, and margins.\n● Automating suppliers/captains weekly payout process across markets.\n● Automating B2B clients monthly invoicing with a seamless & convenient digitized flow to ensure efficiency and enhance customer\nexperience.\n● Identify operational areas with potential of enhancements to drive efficiency, productivity & cost control.\n● Coordinating with Product teams in discovery, problem statement, specs, impact sizing and testing.\n● Digitize & automate manual/offline operations.\n● Build features/tools/scripts with customized logics to fulfill fast-paced business needs and drive operational excellence.",
      "highlights": ["Conducted a deep analysis (1000+ lines of queries) to identify, clean, and prevent fraud patterns in the fines reimbursement process, while capturing all the market related trends (highest #fines per station, GMV vs reimbursements amount per station/route...etc) in order to enhance our operational & network efficiency and minimize reimbursement.", "Revamped the fines reimbursement policy and introduced a fully automated process; ideated, scoped, and launched a machine learning model to classify, auto-validate, and extract data from the fines receipts uploaded on the app. Decreased ∼50% of reimbursements monthly cost over the first 3 months ∼$40k while maintaining a seamless suppliers & captain experience, saved 160+ weekly working hours of manual back-office activities, and was adopted by the global team.", "Ideated, scoped, and launched a technical automated process for valid toll stations reimbursement based on route & stations lat/long coordinates. decreased the financial toll tickets by ∼98%, saved 80 weekly working hours of manual back-office activities, contributed to a seamless supplier’s payment experience, and was adopted by the global team.", "Scoped and launched a technical automated process for financial tickets resolution & invoicing (400+ lines of python scripts) consisting of a set of auto-checks & validation logics for different business cases. Decreased unescalated ticket resolution time to a mean of 24 hours.", "Revamped, scoped, and launched an automated performance incentive model in coordination with the commercial team to drive the relevant quality metrics & ensure maximum ROI.", "Got promoted in 6 months to a regional central role, managing 9+ markets."]
    },
    {
      "name": "Swvl, Cairo, Egy",
      "position": "Senior Operations Lead",
      "url": "https://swvl.io",
      "startDate": "2021-09-01",
      "endDate": "2021-12-01",
      //      "summary": "Leading operations & payments teams of 9 individuals across 9+ markets, program managed the business as usual ops in my function.\n● Planning & executing global projects/strategies/roadmaps with the global leadership team.\n● Setting-up global strategies, workflows, processes, KPIs, SOPs, and SLAs, to meet org objectives per each market.\n● Structuring viable GTM strategies for different projects.\n● Build Pnl & financial automated reporting/tracking tools & platforms.\n● Coordination between different Internal & external stakeholders.\n● Reviewing different incentives, penalties, pricing schemes, and margins.\n● Automating suppliers/captains weekly payout process across markets.\n● Automating B2B clients monthly invoicing with a seamless & convenient digitized flow to ensure efficiency and enhance customer\nexperience.\n● Identify operational areas with potential of enhancements to drive efficiency, productivity & cost control.\n● Coordinating with Product teams in discovery, problem statement, specs, impact sizing and testing.\n● Digitize & automate manual/offline operations.\n● Build features/tools/scripts with customized logics to fulfill fast-paced business needs and drive operational excellence.",
      "highlights": ["Scoped and launched cross-utilization project aimed to decrease operational & acquisition cost while increasing existing captains’ earnings by availing different fleet resources & vaste network from each different business lines and offer enhanced opportunities to their captains, including setting up processes, tools, integrations, and GTM strategy. Decreased operational & acquisition cost by ∼7% across categories, increased participating captains’ earning by ∼40%, and achieved 33% cross-utilized captains of the base fleet.", "Got promoted within the first 3 months to a managerial role."]
    },
    {
      "name": "Edecs Engineering, Cairo, Egy",
      "position": "Project Manager / BIM Manager",
      "url": "",
      "startDate": "2020-01-01",
      "endDate": "2021-01-01",
      "summary": "Engineering projects management, Information management, digitizing operations, processes, and activities, Automated workflow plugins, Resource planning, Cost Control, Project timeline, Coordination between internal/external stakeholders.",
      "highlights": []
    },
    {
      "name": "Elgabaly Consultancy, Cairo, Egy",
      "position": "Project Manager / BIM Coordinator",
      "url": "",
      "startDate": "2019-01-01",
      "endDate": "2020-01-01",
      "summary": "Engineering projects management, Information management, digitizing operations, processes, and activities, automated workflow plugins, Coordination between internal/external stakeholders, implementing digital twins.",
      "highlights": []
    },
    {
      "name": "T.H.E Consultancy, Cairo, Egy",
      "position": "Project Lead",
      "url": "",
      "startDate": "2018-01-01",
      "endDate": "2019-01-01",
      "summary": "RFIs, RFCs, Comms management, Preparing technical documents, Billing documents, Coordination between internal/external stakeholders, implementing digital twins.",
      "highlights": []
    },
    {
      "name": "Shaker Group, Cairo, Egy",
      "position": "Project Coordinator",
      "url": "",
      "startDate": "2017-01-01",
      "endDate": "2018-01-01",
      "summary": "RFIs, RFCs, Comms management, Preparing technical documents, Billing documents, Coordination between internal/external stakeholders, implementing digital twins.",
      "highlights": []
    }
  ],
//  "volunteer": [
//    {
//      "organization": "",
//      "location": "",
//      "position": "",
//      "url": "",
//      "startDate": "",
//      "endDate": "",
//      "summary": "",
//      "highlights": []
//    }
//  ],
  "education": [
    {
      "institution": "Stanford University, CA, US",
      "location": "CA, US",
      "url": "https://www.stanford.edu/",
      "area": "Artificial Intelligence",
      "studyType": "Graduate Certificate",
      "startDate": "2023-04-01",
//      "endDate": "1905-01-01",
      "score": "B",
      "courses": ["CS229 - Machine Learning w/ Andrew Ng, Tengyu Ma, Christopher Re", "CS221 - AI Principals & Techniques w/ Percy Liang, Dorsa Sadigh", "CS224N - Natural Language Processing with Deep Learning w/ Christopher D. Manning"]
    },
    {
      "institution": "MSA University, Cairo, Egy",
      "location": "Cairo, Egy",
      "url": "https://msa.edu.eg/msauniversity/",
      "area": "Engineering",
      "studyType": "Bachelor of Engineering",
      "startDate": "2010-06-01",
      "endDate": "2016-06-01",
      "score": "B",
      "courses": []
    },
    {
      "institution": "College De La Salle, Cairo, Egy",
      "location": "Cairo, Egy",
      "url": "https://msa.edu.eg/msauniversity/",
      "area": "",
      "studyType": "High School Degree",
      "startDate": "1995-06-01",
      "endDate": "2009-06-01",
      "score": "B",
      "courses": []
    }
  ],
//  "awards": [
//    {
//      "title": "Nobel Prize in Physics",
//      "date": "1921-11-01",
//      "awarder": "Royal Swedish Academy of Sciences",
//      "url": "https://www.nobelprize.org/prizes/physics/1921/einstein/biographical/",
//      "summary": "The Nobel Prizes are five separate prizes that, according to Alfred Nobel's will of 1895, are awarded to 'those who, during the preceding year, have conferred the greatest benefit to humankind.'"
//    }
//  ],
  "certificates": [
    {
      "name": "Neural Networks and Deep Learning",
      "date": "2023-02-01",
      "issuer": "DeepLearning.AI",
      "url": "https://www.coursera.org/account/accomplishments/certificate/576BM8QGKLJW",
      "icon": "fa-solid fa-clipboard-check"
    },
    {
      "name": "Improving Deep Neural Networks: Hyperparameter Tuning, Regularization and Optimization",
      "date": "2023-02-01",
      "issuer": "DeepLearning.AI",
      "url": "https://www.coursera.org/account/accomplishments/certificate/Y3Q32LHMLQ7K",
      "icon": "fa-solid fa-clipboard-check"
    },
    {
      "name": "Structuring Machine Learning Projects",
      "date": "2023-02-01",
      "issuer": "DeepLearning.AI",
      "url": "https://www.coursera.org/account/accomplishments/certificate/3AY29Q7Q7Y2G",
      "icon": "fa-solid fa-clipboard-check"
    }
  ],
  "publications": [
    {
      "name": "arXivBot",
      "publisher": "",
      "releaseDate": "2024-06-10",
      "url": "https://www.academia.edu/122435978/arXivBot",
      "summary": "The project goal is to build an arXiv chatbot capable of retrieving and selecting relevant research papers new or old according to a criteria specified by the user in natural language (ex. submission/revision date, domain/category, topic...etc). As well as answering users’ questions about the papers and being able to summarize & highlight key points of the paper topics. At the current accelerating speed of research and advances in various fields; every month, 20,000 new papers are posted to arxiv.org, including 9,000 papers in the Computer Science category, keeping up with the latest progress and advances has become tedious. This chatbot will help researchers and practitioners to keep up with the latest advances and up-to-date progress in different fields, by being able to search, retrieve, and summarize the new released papers in a streamlined approach. This study deploys multiple tech- niques to implement a lightweight yet efficient LLM system capable of achieving state-of-the-art results, including QLoRA quantization [1] and Parameter-Efficient Fine-Tuning (PEFT) instruction fine-tuning with LoRA, as well as incorporat- ing Function Calling, In-Context Learning & a Modular Retrieval Augmented Generation (RAG) process in the system [2]."
    },
    {
      "name": "E-Commerce Product Recommendation System",
      "publisher": "",
      "releaseDate": "2023-06-13",
      "url": "",
      "summary": "E-commerce today plays a vital role in our daily lives, it has redefined the commer- cial business around the world. Most of the E-commerce companies like Amazon, Shein, BestBuy, Zalando, eBay, are using Recommender systems for product sug- gestions to their users and launching promotional campaigns. According to recent studies, 35% of Amazon’s purchases [4] are driven by algorithmic recommenda- tions. This study will focus on building a product recommender based on data from Amazon using several methods; Naive Baytes, Item Affinity, and Matrix Factorization. In addition to exploring & measure the impact of using MLP with residual blocks on the users ratings prediction performance which will pave the path to also explore the utilization of products images using multi-modal neural networks."
    }
  ],
  "skills": [
    {
      "name": "AI & Machine Learning",
      "level": "Master",
      "icon": "fa-solid fa-hashtag",
      "keywords": [
        "LLMs",
        "RAG",
        "RLHF",
        "Human-LLM interaction",
        "Pretraining",
        "Fine-tuning",
        "CNN",
        "RNN",
        "NLP",
        "Transformers",
        "PyTorch",
        "TensorFlow",
        "Keras",
        "SageMaker",
        "Computer Vision"
      ]
    },
    {
      "name": "Data & Analytics",
      "level": "Master",
      "icon": "fa-solid fa-hashtag",
      "keywords": [
        "Apache Spark",
        "Apache Airflow",
        "Redash",
        "Bigquery",
        "Glue",
        "S3",
        "Redshift",
        "Tableau",
        "Apache Superset",
        "PowerBi",
        "Plotly",
        "Matplotlib",
        "MongoDB",
        "dbt",
        "Data visualization",
        "Pandas",
        "NumPy",
        "Business & Predictive Analysis",
        "Data Engineering",
        "Data Warehousing",
        "Automated Reporting & Insights"
      ]
    },
    {
      "name": "Technologies & Frameworks",
      "level": "Master",
      "icon": "fa-solid fa-hashtag",
      "keywords": [
        "Python",
        "SQL",
        "Js",
        "CSS",
        "HTML",
        "Django",
        "Flask"
      ]
    }
  ],
  "languages": [
    {
      "language": "Arabic",
      "fluency": "Native speaker",
      "icon": ""
    },
    {
      "language": "English",
      "fluency": "Fluent",
      "icon": ""
    },
    {
      "language": "French",
      "fluency": "Fluent",
      "icon": ""
    }
  ],
  "interests": [
    {
      "name": "Travelling",
      "icon": "fa-solid fa-tag",
      "keywords": [
//        "Quantum Mechanics",
//        "Quantum Computing",
//        "Quantum Information",
//        "Quantum Cryptography",
//        "Quantum Communication",
//        "Quantum Teleportation"
      ]
    },
    {
      "name": "Fitness",
      "icon": "fa-solid fa-tag",
      "keywords": [
      ]
    },
    {
      "name": "Audiobooks",
      "icon": "fa-solid fa-tag",
      "keywords": [
      ]
    },
    {
      "name": "Music",
      "icon": "fa-solid fa-tag",
      "keywords": [
      ]
    }
  ],
  "references": [
//    {
//      "name": "Professor John Doe",
//      "icon": "fa-solid fa-laptop",
//      "reference": "Lorem ipsum dolor sit amet, consectetur adipiscing elit. Aliquam condimentum, diam quis convallis euismod, arcu mi ullamcorper lorem, a vestibulum nunc magna at sem. Sed in risus ac felis varius blandit. D"
//    },
//    {
//      "name": "Professor John Doe",
//      "icon": "fa-solid fa-thumbtack",
//      "reference": "Lorem ipsum dolor sit amet, consectetur adipiscing elit. Aliquam condimentum, diam quis convallis euismod, arcu mi ullamcorper lorem, a vestibulum nunc magna at sem. Sed in risus ac felis varius blandit. D"
//    }
  ],
  "projects": [
//    {
//      "name": "Quantum Computing",
//      "summary": "Quantum computing is the use of quantum-mechanical phenomena such as superposition and entanglement to perform computation. Computers that perform quantum computations are known as quantum computers.",
//      "highlights": ["Quantum Teleportation", "Quantum Cryptography"],
//      "startDate": "2018-01-01",
//      "endDate": "2018-01-01",
//      "url": "https://example.com"
//    }
  ]
}
